{"Name":"Greg","businessCategory": 4, "rating": 1, "reviewText": "What an amazing car buying experience!  The entire staff was so helpful and never pressured or rushed us to buy anything.  I'd highly recommend buying a car from them. I definitely plan to buy my next one here too.\n\nThank you Darin, Glenn, Marc, Tom and Jamie for taking the time to walk us through many options while making the whole process enjoyable.  I'll definitely be back to buy again."}
{"Name":"Sophie","businessCategory": 0, "rating": 1, "reviewText": "Enjoyed a nice anniversary dinner. The live music was nice, not too loud. The scallops entree I had and the Rib Eye my husband had were perfectly prepared. The drinks were good but we only wanted one each and had to reiterate that a couple of times with different servers, (felt like a little bit of sales pressure on the drinks throughout our meal). \nThe homemade donuts with creme brulee filling are amazing! \nLove ambience of this restaurant as it's light and airy and has a lot of very comfortable seating."}
{"Name":"Frank","businessCategory": 3, "rating": 1, "reviewText": "I have been going to performance physical therapy off and on now for 15 plus years for back issues and Danny and his staff have been excellent. They are consistence, caring and all well educated in physical therapy. I have gone to different PT offices in the past and there is none that compares to Performance Physical Therapy! Thank you Danny, Joel, Roxy, Sam, Ashley, and Kathy !"}
{"Name":"Felix","businessCategory": 3, "rating": 1, "reviewText": "This is for the labor & delivery floor- \nI spent last week in the hospital for having a large kidney stone while pregnant. And I just want to thank the amazing nursing staff I had for all taking such good care of me! Especially because some days I was there alone! Some of my nurses were Amanda, Cierra, Kay, Shelia, Erin, and Lizz. They were all so sweet and my husband and I were so happy with the care they provided!"}
{"Name":"Chris","businessCategory": 0, "rating": 0, "reviewText": "This place is very old and kind of run down.  The sofas were stained.  The shower would go from freezing to scalding without warning.  The toilets frequently required multiple flushes.  Tiles everywhere were cracked or broken.  And the restaurant was horribly expensive.  I will say that the place was clean.  It was also very conveniently located a half block off the Strip.  The staff was always very polite, friendly, and helpful.  All said and done, I probably won't stay here again."}
{"Name":"Joe","businessCategory": 4, "rating": 1, "reviewText": "This place has great service! I needed a new windshield wiper and a new tail light. They knew the exact replacement parts that I needed, and they replaced both parts for free! The prices here are also much more reasonable than going to a dealership or auto repair shop."}
{"Name":"John","businessCategory": 3, "rating": 0, "reviewText": "Bought the groupon, been calling for 3 days now. No one ever answers or returns messages."}
{"Name":"Sarah","businessCategory": 1, "rating": 0, "reviewText": "Has all the basics. Also has the great deals time to time. Some of the staff is wonderful (specifically the late-night women)... but others certainly could use a lot of work in terms of personal hygiene (picking at nails, long greasy hair), and poor manners. But- it is close to old town party scene, so I guess you'll have some of that. \n\nPrefer the Frys off Hayden in North Scottsdale. Best staff, huge selections, pristine inside and out. Too bad I'm closer to this one..."}